In [1]:
import numpy as np

In [3]:
 import pandas as pd

In [5]:
from numpy.random import randn

In [7]:
np.random.seed(10)

In [9]:
randn(5,4)

array([[ 1.3315865 ,  0.71527897, -1.54540029, -0.00838385],
       [ 0.62133597, -0.72008556,  0.26551159,  0.10854853],
       [ 0.00429143, -0.17460021,  0.43302619,  1.20303737],
       [-0.96506567,  1.02827408,  0.22863013,  0.44513761],
       [-1.13660221,  0.13513688,  1.484537  , -1.07980489]])

In [11]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='S T U V  '.split())

In [13]:
df

          S         T         U         V
A -1.977728 -1.743372  0.266070  2.384967
B  1.123691  1.672622  0.099149  1.397996
C -0.271248  0.613204 -0.267317 -0.549309
D  0.132708 -0.476142  1.308473  0.195013
E  0.400210 -0.337632  1.256472 -0.731970

In [45]:
df['S']

A    0.117476
B   -0.144367
C    0.706830
D    2.404326
E   -0.439026
Name: S, dtype: float64

In [15]:
df[['S']]

          S
A -1.977728
B  1.123691
C -0.271248
D  0.132708
E  0.400210

In [61]:
df[['S','T','V']]

          S         T         V
A  0.117476 -1.907457  0.469751
B -0.144367 -0.400138  0.848209
C  0.706830 -0.787269 -0.470807
D  2.404326 -0.739357 -0.348882
E -0.439026  0.141104 -1.618571

In [75]:
df.S

A    0.117476
B   -0.144367
C    0.706830
D    2.404326
E   -0.439026
Name: S, dtype: float64

In [83]:
df['new']=df['S']+df['T']

In [85]:
df

          S         T         U         V       new
A  0.117476 -1.907457 -0.922909  0.469751 -1.789981
B -0.144367 -0.400138 -0.295984  0.848209 -0.544505
C  0.706830 -0.787269  0.292941 -0.470807 -0.080438
D  2.404326 -0.739357 -0.312829 -0.348882  1.664969
E -0.439026  0.141104  0.273049 -1.618571 -0.297922

In [87]:
df.drop('new',axis=1)

          S         T         U         V
A  0.117476 -1.907457 -0.922909  0.469751
B -0.144367 -0.400138 -0.295984  0.848209
C  0.706830 -0.787269  0.292941 -0.470807
D  2.404326 -0.739357 -0.312829 -0.348882
E -0.439026  0.141104  0.273049 -1.618571

In [89]:
df

          S         T         U         V       new
A  0.117476 -1.907457 -0.922909  0.469751 -1.789981
B -0.144367 -0.400138 -0.295984  0.848209 -0.544505
C  0.706830 -0.787269  0.292941 -0.470807 -0.080438
D  2.404326 -0.739357 -0.312829 -0.348882  1.664969
E -0.439026  0.141104  0.273049 -1.618571 -0.297922

In [93]:
df.drop('new',axis=1,inplace=True)

In [95]:
df

          S         T         U         V
A  0.117476 -1.907457 -0.922909  0.469751
B -0.144367 -0.400138 -0.295984  0.848209
C  0.706830 -0.787269  0.292941 -0.470807
D  2.404326 -0.739357 -0.312829 -0.348882
E -0.439026  0.141104  0.273049 -1.618571

In [99]:
df.drop('E',axis=0)

          S         T         U         V
A  0.117476 -1.907457 -0.922909  0.469751
B -0.144367 -0.400138 -0.295984  0.848209
C  0.706830 -0.787269  0.292941 -0.470807
D  2.404326 -0.739357 -0.312829 -0.348882

In [101]:
df

          S         T         U         V
A  0.117476 -1.907457 -0.922909  0.469751
B -0.144367 -0.400138 -0.295984  0.848209
C  0.706830 -0.787269  0.292941 -0.470807
D  2.404326 -0.739357 -0.312829 -0.348882
E -0.439026  0.141104  0.273049 -1.618571

In [107]:
df.loc['E']

S   -0.439026
T    0.141104
U    0.273049
V   -1.618571
Name: E, dtype: float64

In [109]:
df.iloc[2]

S    0.706830
T   -0.787269
U    0.292941
V   -0.470807
Name: C, dtype: float64

In [111]:
df.loc['A','T']

-1.9074568881244003

In [121]:
df.loc[['A','D'],['S','U']]

          S         U
A  0.117476 -0.922909
D  2.404326 -0.312829

In [123]:
df[df>0]

          S         T         U         V
A  0.117476       NaN       NaN  0.469751
B       NaN       NaN       NaN  0.848209
C  0.706830       NaN  0.292941       NaN
D  2.404326       NaN       NaN       NaN
E       NaN  0.141104  0.273049       NaN

In [131]:
df[df['S']>0]

          S         T         U         V
A  0.117476 -1.907457 -0.922909  0.469751
C  0.706830 -0.787269  0.292941 -0.470807
D  2.404326 -0.739357 -0.312829 -0.348882

In [143]:
df[df['S']>0][['T','U']]

          T         U
A -1.907457 -0.922909
C -0.787269  0.292941
D -0.739357 -0.312829

In [145]:
df.reset_index()

  index         S         T         U         V
0     A  0.117476 -1.907457 -0.922909  0.469751
1     B -0.144367 -0.400138 -0.295984  0.848209
2     C  0.706830 -0.787269  0.292941 -0.470807
3     D  2.404326 -0.739357 -0.312829 -0.348882
4     E -0.439026  0.141104  0.273049 -1.618571

In [147]:
new='SA ED RF TG RE'.split()
new

['SA', 'ED', 'RF', 'TG', 'RE']

In [151]:
df['STATES']=new
df

          S         T         U         V STATES
A  0.117476 -1.907457 -0.922909  0.469751     SA
B -0.144367 -0.400138 -0.295984  0.848209     ED
C  0.706830 -0.787269  0.292941 -0.470807     RF
D  2.404326 -0.739357 -0.312829 -0.348882     TG
E -0.439026  0.141104  0.273049 -1.618571     RE

In [163]:
df.set_index('STATES',inplace=True)

In [165]:
df

               S         T         U         V
STATES
SA      0.117476 -1.907457 -0.922909  0.469751
ED     -0.144367 -0.400138 -0.295984  0.848209
RF      0.706830 -0.787269  0.292941 -0.470807
TG      2.404326 -0.739357 -0.312829 -0.348882
RE     -0.439026  0.141104  0.273049 -1.618571